EDT/УТ/src/Documents/КорректировкаУчетаВыходаСотрудниковНаРаботу/КорректировкаУчетаВыходаСотрудниковНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаУчетаВыходаСотрудниковНаРаботу</name>
  <registerRecords>InformationRegister.УчетВыходаНаРаботуСотрудниковКомпании</registerRecords>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникВышелНаРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/УчетВыходаНаРаботуСотрудниковКомпании/УчетВыходаНаРаботуСотрудниковКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетВыходаНаРаботуСотрудниковКомпании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БэйджСотрудника</name>
    <type>
      <types>CatalogRef.БэйджиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>СотрудникВышелНаРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/КорректировкаУчетаВыходаСотрудниковНаРаботу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Движения.УчетВыходаНаРаботуСотрудниковКомпании.Записывать = Истина;
	Движения.УчетВыходаНаРаботуСотрудниковКомпании.Очистить();
		
	Движение = Движения.УчетВыходаНаРаботуСотрудниковКомпании.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.СотрудникВышелНаРаботу = СотрудникВышелНаРаботу;
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	БэйджиСотрудников.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.БэйджиСотрудников КАК БэйджиСотрудников
	                      |ГДЕ
	                      |	БэйджиСотрудников.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Сотрудник);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Движение.БэйджСотрудника = Рез.Ссылка;		
	КонецЕсли;	
		
	
КонецПроцедуры
